---
title: DuctSizeSettingIterator
classe: Autodesk.Revit.DB.Mechanical.DuctSizeSettingIterator
namespace: Autodesk.Revit.DB.Mechanical
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# DuctSizeSettingIterator

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `KeyValuePair<DuctShape, DuctSizes> Current { get; }` | `ductSizeSettingIterator.Current` | KeyValuePair<DuctShape, DuctSizes> |
| `Boolean IsValidObject { get; }` | `ductSizeSettingIterator.IsValidObject` | Boolean |
| `Void Dispose()` | `ductSizeSettingIterator.Dispose()` | Void |
| `Boolean HasCurrent()` | `ductSizeSettingIterator.HasCurrent()` | Boolean |
| `Boolean IsDone()` | `ductSizeSettingIterator.IsDone()` | Boolean |
| `Boolean MoveNext()` | `ductSizeSettingIterator.MoveNext()` | Boolean |
| `Void Reset()` | `ductSizeSettingIterator.Reset()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```